import Foundation

/*
 * Условие:
 * * Дан упорядоченный по неубыванию массив целых 32-разрядных чисел. Требуется удалить из него все повторения.
 * * Желательно получить решение, которое не считывает входной файл целиком в память, т.е., использует лишь константный объем памяти в процессе работы.
 *
 * Ограничения:
 * * По времени: 1 секунда
 * * По памяти: 64Mb
 *
 * Форматы:
 * * Ввода: Первая строка входного файла содержит единственное число n, n ≤ 1000000. На следующих n строк расположены числа — элементы массива, по одному на строку. Числа отсортированы по неубыванию.
 * * Вывода: Выходной файл должен содержать следующие в порядке возрастания уникальные элементы входного массива.
 * * Например:
 * * * Input:
 * * * * 5
 * * * * 2
 * * * * 4
 * * * * 8
 * * * * 8
 * * * * 8
 * * * Output:
 * * * * 2
 * * * * 4
 * * * * 8
 */

let n = Int(readLine()!)!

var set = Set<Int32>()

for _ in 0..<n {
  set.insert(Int32(readLine()!)!)
}

set.sorted().forEach { print($0) }
