import Foundation

/*
 * Условие:
 * * Даны две строки строчных латинских символов: строка J и строка S.
 * * Символы, входящие в строку J, — «драгоценности», входящие в строку S — «камни».
 * * Нужно определить, какое количество символов из S одновременно являются «драгоценностями».
 * * Проще говоря, нужно проверить, какое количество символов из S входит в J.
 *
 * Ограничения:
 * * По времени: 1 секунда
 * * По памяти: 64Mb
 *
 * Форматы:
 * * Ввода: На двух первых строках входного файла содержатся две строки строчных латинских символов: строка J и строка S. Длина каждой не превосходит 100 символов.
 * * Вывода: Выходной файл должен содержать единственное число — количество камней, являющихся драгоценностями.
 * * Например:
 * * * Input:
 * * * * ab
 * * * * aabbccd
 * * * Output:
 * * * * 4
 */

let j = readLine()
let s = readLine()

var result = 0

for i in s! {
  result += (j?.contains(i))! ? 1 : 0
}

print(result)
